app/Controllers/Dashboard.php

SELECT COUNT(*) AS `numrows`
FROM `pengaduan`
WHERE `id_user` = '12'
SELECT COUNT(*) AS `numrows`
FROM `pengaduan`
WHERE `id_user` = '12'
AND `status` = 'selesai'
---
    public function index()
    {
        $session = session();

        if (!session()->get('logged_in')) {
            return redirect()->to('/login');
        }

        $user = $session->get();

        $lokasiModel = new LokasiModel();
        $itemModel = new ItemModel();
        $pengaduanModel = new PengaduanModel();


        $id_user = $user['id_user'];

        $jumlah_pengaduan = $pengaduanModel->where('id_user', $id_user)->countAllResults();
        $jumlah_histori   = $pengaduanModel->where('id_user', $id_user)
                                            ->where('status', 'selesai')
                                            ->countAllResults();

SELECT *
FROM `lokasi`
SELECT *
FROM `items`
---
            return redirect()->to('/dashboard')->with('success', 'Pengaduan berhasil dikirim!');
        }

        $data['lokasi'] = $lokasiModel->findAll();
        $data['items']  = $itemModel->findAll();

SELECT `items`.`id_item`, `items`.`nama_item`
FROM `list_lokasi`
LEFT JOIN `items` ON `list_lokasi`.`id_item` = `items`.`id_item`
WHERE `list_lokasi`.`id_lokasi` = '15'
---
    public function getItems($id_lokasi)
    {
        // pastikan gunakan DB builder
        $db = \Config\Database::connect();

        $builder = $db->table('list_lokasi');
        $builder->select('items.id_item, items.nama_item');
        $builder->join('items', 'list_lokasi.id_item = items.id_item', 'left');
        $builder->where('list_lokasi.id_lokasi', $id_lokasi);
        $query = $builder->get();