app/Controllers/ItemController.php

    public function index()
    {
        $model = new ItemModel();
        $data['items'] = $model->findAll();
---
SELECT *
FROM `items`