app/Controllers/Laporan.php

SELECT *
FROM `laporan`
ORDER BY `id_laporan` DESC
---
    public function index()
    {
        $laporanModel = new LaporanModel();

        $laporanList = $laporanModel
            ->orderBy('id_laporan', 'DESC')
            ->findAll();

DELETE FROM `laporan`
WHERE `id_laporan` IN ('4')
---
    public function delete($id)
    {
        $laporanModel = new LaporanModel();

        if ($laporanModel->find($id)) {
            $laporanModel->delete($id);