app/Controllers/ListLokasiController.php

    public function index()
    {
        $model = new ListLokasiModel();
        $data['list_lokasi'] = $model->findAll();
---
SELECT *
FROM `list_lokasi`