app/Controllers/TemporaryItemController.php

    public function index()
    {
        $model = new TemporaryItemModel();
        $data['row'] = $model->findAll();
---
SELECT *
FROM `temporary_item`